package com.game.MentalBattle.game;

import org.springframework.stereotype.Component;

import java.time.LocalTime;
import java.util.*;

@Component("taskBean")
public class Task {

    private Map<String, Integer> examples = new LinkedHashMap<>();
    private List<Integer> usedRandoms = new ArrayList<>();
    private Map<String, Integer> outputExample = new LinkedHashMap<>();
    private int start;
    private int finish;
    private int money = 0;
    private int correctAnswers = 0;
    private int wrongAnswers = 0;

    public Map<String, Integer> getExample(){
        int number;
        outputExample.clear();
        Random random = new Random();
        while (true){
            number = random.nextInt(30);
            if (!usedRandoms.contains(number)){
                usedRandoms.add(number);
                break;
            }
        }
        return findOutputExample(number);
    }

    public void createExamples(){
        examples.put("Знайти найбільший спільний дільник чисел 42 і 63",21);
        examples.put("Знайти найменше спільне кратне чисел 28 і 35", 140);
        examples.put("Знайти значення числового виразу: 15 4/14 + 11 5/7 : (4 1/2 * 2 2/9 - 3 1/6)",17);
        examples.put("Обчисліть: (3 1/6 + 5.2)/((4.6 - 5/12) * 0.4)",5);
        examples.put("Визначте кількість усіх дробів із знаменником 28, які більші за 4/7, але менші від 3/4",4);
        examples.put("У коробці лежать різнокольорові кульки, з яких 40 - червоні, 20 - коричневі, а всі, що залишилися - жовті. З'ясуйте, скільки жовтих кульок лежить у коробці, якщо ймовірність вибору випадковим чином жовтої кульки дорівнює 0,75:",180);
        examples.put("Додатне число А більше за додатне число В у 3.8 раза. На скільки відсотків число А більше за число В?", 280);
        examples.put("Остача від ділення натурального числа k на 5 дорівнює 2. Укажіть остачу від ділення на 5 числа k+21",3);
        examples.put("Сторона основи правильної чотирикутної призми дорівнює 3 см, а периметр її бічної грані - 22 см. Знайдіть площу бічної поверхні цієї призми",96);
        examples.put("При кожному пострілі в мішень спортсмен влучав або в 'десятку' або в 'дев'ятку', за що йому нараховувалося 10 або 9 очок відповідно. За 10 пострілів він набрав 94 очки. Скільки разів з цих пострілів спортсмен влучив у 'дев'ятку'?",6);
        examples.put("У прямокутній трапеції ABCD (AB||CD) діагональ AC перпендикулярна до бічної сторони CD. Знайдіть довжину цієї діагоналі (у см), якщо AD = 18 см, BC = 8 см.", 12);
        examples.put("Сторона основи правильної чотирикутної піраміди дорівнює 4 см, а об'єм - 64 см куб. Знайдіть висоту піраміди",12);
        examples.put("Скільки всього існує різних двоцифрових чисел, у яких перша цифра є парною, а друга - непарною?",20);
        examples.put("Упродовж одного дня громадянин уклав з двома банками кредитні угоди на один рік: із першим банком під 12% річних, із другим - під 15% річних. Загальна сума грошей, отриманих за кредитними угодами, становить 5000 грн. Погашення кредитів здійснюється одноразовим внеском в останній день дії угод. Нарахована сума відсотків за користування кредитами сиановить 654 грн. Скільки грошей (у грн) узяв громадянин під більші відсотки,", 1800);
        examples.put("Обчисліть: (3^5 * 5^4)/15^3",45);
        examples.put("Чотирикутник ABCD описаний навколо кола. AB = 12 см, BC = 8см, CD = 18 см. Знайдіть довжину сторони AD",22);
        examples.put("Заступник директора школи складає розклад уроків для 10-го класу. Він запланував на понеділок шість уроків з таких предметів: геометрія, біологія, історія, хімія, фізична культура, географія. Скільки всього існує різних варіантів розкладу уроків на цей день, якщо урок біології має бути останнім у розкладі?",120);
        examples.put("Точка А(3;1) належить колу з центром у точці О(-2;1). Знайдіть радіус цього кола",5);
        examples.put("Об'єм цидіндра дорівнює 48 см куб. Знайдіть об'єм конуса, радіус основи якого дорівнює радіусу основи циліндра, а висота вдвічі менша за висоту циліндра",8);
        examples.put("У кіоску є 10 видів вітальних листівок з Новим роком. Скільки всього можна утворити різних наборів листівок, кожен із яких складається з трьох листівок різних видів?",120);
        examples.put("Скільки всього граней у піраміди, яка має 12 ребер?",7);
        examples.put("Скільки всього різних двоцифрових чисел можна утворити з цифр 1, 5, 7 і 8 так, щоб у кожному числі всі цифри не повторювалися?",12);
        examples.put("Студенти однієї з груп повинні скласти п'ять іспитів. Заступнику декана потрібно призначити складання цих іспитів на п'ять визначених дат. Скільки всього існує різних варіантів розкладу іспитів для цієї групи?",120);
        examples.put("Марійка зірвала на клумбі 9 нарцисів та 4 тюльпани. Скільки всього існує способів вибору із цих квітів 3 нарцисів та 2 тюльпанів для букета?",504);
        examples.put("У магазині в продажу є 6 видів тарілок, 8 видів блюдець та 12 видів чашок. Яна збирається купити бабусі в подарунок у цьому магазині або чашку та блюдце, або лише тарілку. Скільки всього є способів в Яни купити бабусі такий подарунок?",102);
        examples.put("До складу української Прем'єр-ліги з футболу входять 16 команд. Упродовж сезону кожні дві команди грають між собою 2 матчі. Скільки всього матчів буде зіграно за сезон?",240);
        examples.put("У залі кінотеатру 18 рядів. У першому ряду знаходиться 7 місць, а в кожному наступному ряду на 2 місця більше, ніж у попередньому. Скільки всього місць у цьому залі?",432);
        examples.put("Лідія редагує 80 сторінок рукопису у 8 разів швидше, ніж Максим редагує 480 сторінок. Скільки сторінок відредагує Максим за той самий сильний час, за який Лідія відредагує 320 сторінок?",240);
        examples.put("Сторони трикутника, одна з яких на 8 см більша за другу, утворюють кут 120 градусів, а довжина третьої сторони дорівнює 28 см. Знайдіть периметр трикутника",60);
        examples.put("Чотирикутник ABCD описаний навколо кола. AB = 12 см, BC = 8 см, CD = 18 см. Знайдіть довжину сторони AD",22);
    }

    public Map<String, Integer> findOutputExample(int number){
        Iterator<String> iteratorCondition = examples.keySet().iterator();
        Iterator<Integer> iteratorAnswer = examples.values().iterator();
        int count = 0;
        while (iteratorCondition.hasNext()){
            String condition = iteratorCondition.next();
            int answer = iteratorAnswer.next();
            if (count==number){
                outputExample.put(condition,answer);
                break;
            }
            count++;
        }
        return outputExample;
    }

    public void fixStart(){ start = LocalTime.now().getSecond(); }

    public void fixFinish(){ finish = LocalTime.now().getSecond(); }

    public void calculateScore(int correctAnswer, int providedAnswer){
        if (correctAnswer!=providedAnswer){
            wrongAnswers++;
        }
        else {
            correctAnswers++;
            int time = finish-start;
            if (time<=30) money+=300;
            else money += Math.max(200 - time, 30);
        }
    }

    public int getMoney(){return money;}

    public int getCorrectAnswers() {
        return correctAnswers;
    }

    public int getWrongAnswers() {
        return wrongAnswers;
    }
}
